{"ID":"4d47e912-0713-43a4-a00c-50be12f320bd","DefinitionID":1002124,"UserID":"a22fe054-c6ce-45c6-86c3-d6791aff032c","WordID":"a0d2ce3a-7580-47c6-911d-d3dd2ac53916","Definition":"There is no one single definition of what a furry is. Even within the furry fandom, people cannot always agree on just what makes a person a furry or not.\r\rSome would argue that to be a furry, you must think and talk like one (i.e. use furry specific words and phrases). Even if you go to conventions, wear a fursuit, draw the art, writes the stories etc but don't talk using furry lingo, you're not a furry. Basically, someone that may walk the walk but doesn’t talk the talk.\r\rOthers would argue that even liking anthropomorphic creatures makes you a furry. You may have no idea the furry fandom exists or have ever heard of a furry convention, let alone any of the websites; simply liking 'anthro' critters makes you a furry.\r\rThe way I see it, if or if you don’t consider yourself a furry is a matter of personal opinion.\r\rAs with any hobby, most furries are normal people just like anyone you'll meet at work/school or going to/from work/school or anywhere. Then there is the small percent that are hard core fans and have taken what for most is a hobby and perverted it (sometimes in an all to literal sense). \r\rAs is with so many other things in life, the few that take it too far tend to be the loudest. The silent majority are often forced into silence by the loud majority for fear that people will label them as being in the same class as the minority that have perverted it.\r\rOne unfortunate side effect of the internet and the relative anonymity that some sites grant their users is people are able to engage in activities (even if only on a virtual level) that they would never even consider doing in real life. An example of this is trolls of message boards that say things to people they’d never say to them in person. I think a lot of the stereotypes associated with furries are because of this.\r\rIn conclusion, as with any hobby, there are some furries that have taken it too far and/or perverted what for many is a fun harmless hobby.","ThumbsDown":4287,"ThumbsUp":15125,"DatePosted":"2005-01-16T00:00:00","Rank":1}