{"ID":"34086d09-abcc-4823-9f1a-b12237034ab3","DefinitionID":1479109,"UserID":"556ec98d-c68c-46bf-bef1-5c1c44ff5efe","WordID":"35aa1b49-ab90-4db2-a66a-c2146b5a336d","Definition":"1. One of the most popular swear/cuss/curse words/profanities\r\r2. another word Feces. Poop. Dookie. Scheisse. Poo Poo. Brownies.\r\rThe Shit List:\r\rThe Ghost Shit \rThe kind where you feel shit come out, see shit on the toilet paper, but there's no shit in the bowl. \r\rThe Clean Shit \rThe kind where you feel shit come out, see shit in the bowl, but there's no shit on the toilet paper. \r\rThe Wet Shit \rYou wipe your ass fifty times and it still feels unwiped. So you end up putting toilet paper between your ass and your underwear so you don't ruin them with those dreadful skid marks. \r\rThe Second Wave Shit \rThis shit happens when you've finished, your pants are up to your knees, and you suddenly realize you have to shit some more. \r\rThe Brain Hemorrahage Through Your Nose Shit \rAlso known as \"Pop a Vein in Your Forehead Shit\". You have to strain so much to get it out that you turn purple and practically have a stroke. \r\rThe Corn Shit \rNo explanation necessary. \r\rThe Lincoln Log Shit \rThe kind of shit that's so enormous you're afraid to flush it down without first breaking it up into little pieces with the toilet brush. \r\rThe Nororius Drinker Shit \rThe kind of shit you have the morning after a long night of drinking. It's most noticeable trait is the tread mark left on the bottom of the toilet bowl after you flush. \r\rThe \"Gee, I Really Wish I Could Shit\" Shit \rThe kind where you want to shit, but even after straining your guts out, all you can do is sit on the toilet, cramped and farting. \r\rThe Wet Cheeks Shit \rAlso known as the \"Power Dump\". That's the kind that comes out of your ass so fast that your butt cheeks get splashed with the toilet water. \r\rThe Liquid Shit \rThat's the kind where yellowish-brown liquid shoots out of your butt, splashes all over the side of the toilet bowl and, at the same time, chronically burns your tender poop-chute. \r\rThe Mexican Food Shit \rA class all on its own. \r\rThe Crowd Pleaser \rThis shit is so intriguing in size and/or appearance that you have to show it to someone before flushing. \r\rThe Mood Enhancer \rThis shit occurs after a lengthy period of constipation, thereby allowing you to be your old self again. \r\rThe Ritual \rThis shit occurs at the same time each day and is accomplished with the aid of a newspaper. \r\rThe Guinness Book Of Records Shit \rA shit so noteworthy it should be recorded for future generations. \r\rThe Aftershock Shit \rThis shit has an odour so powerful than anyone entering the vicinity within the next seven hours is affected. \r\rThe \"Honeymoon's Over\" Shit \rThis is any shit created in the presence of another person. \r\rThe Groaner \rA shit so huge it cannot exit without vocal assistance. \r\rThe Floater \rCharacterized by its floatability, this shit has been known to resurface after many flushings. \r\rThe Ranger \rA shit which refuses to let go. It is usually necessary to engage in a rocking or bouncing motion, but quite often the only solution is to push it away with a small piece of toilet paper. \r\rThe Phantom Shit \rThis appears in the toilet mysteriously and no one will admit to putting it there. \r\rThe Peek-A-Boo Shit \rNow you see it, now you don't. This shit is playing games with you. Requires patience and muscle control. \r\rThe Bombshell \rA shit that comes as a complete surprise at a time that is either inappropriate to shit (i.e. during lovemaking or a root canal) or you are nowhere near shitting facilities. \r\rThe Snake Charmer \rA long skinny shit which has managed to coil itself into a frightening position - usually harmless. \r\rThe Olympic Shit \rThis shit occurs exactly one hour prior to the start of any competitive event in which you are entered and bears a close resemblance to the Drinker's Shit. \r\rThe Back-To-Nature Shit \rThis shit may be of any variety but is always deposited either in the woods or while hiding behind the passenger side of your car. \r\rThe Pebbles-From-Heaven Shit \rAn adorable collection of small turds in a cluster, often a gift from God when you actually can't shit. \r\rPremeditated Shit \rLaxative induced. Doesn't count. \r\rShitzopherenia \rFear of shitting - can be fatal! \r\rEnergizer Vs. Duracell Shit \rAlso known as a \"Still Going\" shit. \r\rThe Power Dump Shit \rThe kind that comes out so fast, you barely get your pants down when you're done. \r\rThe Liquid Plumber Shit \rThis kind of shit is so big it plugs up the toilet and it overflows all over the floor. (You should have followed the advice from the Lincoln Log Shit.) \r\rThe Spinal Tap Shit \rThe kind of shit that hurts so much coming out, you'd swear it's got to be coming out sideways. \r\rThe \"I Think I'm Giving Birth Through My Asshole\" Shit \rSimilar to the Lincoln Log and The Spinal Tap Shits. The shape and size of the turd resembles a tall boy beer can. Vacuous air space remains in the rectum for some time afterwards. \r\rThe Porridge Shit \rThe type that comes out like toothpaste, and just keeps on coming. You have two choices: a) flush and keep going, or b) risk it piling up to your butt while you sit there helpless. \r\rThe \"I'm Going To Chew My Food Better\" Shit \rWhen the bag of Doritos you ate last night lacerates the insides of your rectum on the way out in the morning. \r\rThe \"I Think I'm Turning Into A Bunny\" Shit \rWhen you drop lots of cute, little round ones that look like marbles and make tiny splashing sounds when they hit the water. \r\rThe \"What The Hell Died In Here?\" Shit \rAlso sometimes referred to as \"The Toxic Dump\". Of course you don't warn anyone of the poisonous bathroom odour. Instead, you stand innocently near the door and enjoy the show as they run out gagging and gasping for air. \r\rThe \"I Just Know There's A Turd Still Dangling There\" Shit \rWhere you just sit there patiently and wait for the last cling-on to drop off because if you wipe now, it's going to smear all over the place. ","ThumbsDown":3448,"ThumbsUp":43587,"DatePosted":"2005-10-13T00:00:00","Rank":1}